src/DataProcessors/ПечатьЭтикетокИЦенников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ПечатьЭтикетокИЦенников</Name>
			<Comment>Обработка создания печатных ценников и этикеток</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Comment>Вид цены номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Текущая организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>Текущая клиника</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеныНаДату</Name>
					<Comment>Дату на которую установлены цены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДляПечати</Name>
					<Comment>Выбранный шаблон для для печати</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяПринтерЭтикеток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Comment>Партия</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Comment>Упаковка номенклатуры.</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество печатаемых форм</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Comment>Партия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Comment>Упаковка номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена на номенклатуру</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Comment>Штрихкод номенклатуры</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокНаСкладе</Name>
							<Comment>Количество номенклатуры на складе</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонЦенника</Name>
							<Comment>Шаблон для печати</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХранилищеШаблонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЦенников</Name>
							<Comment>Количество форм для печати</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущество</Name>
					<Comment>Имущество организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПеремещениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПеремещениеЗапасов</Name>
			<BasedOn>
				<xr:Item>Document.Поступление</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиницаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/ПечатьЭтикетокИЦенников/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы    

// Процедура выполняет загрузку настроек отбора из настроек по умолчанию.
//
&НаСервере
Процедура ЗагрузитьНастройкиОтбораПоУмолчанию()
	
	СхемаКомпоновкиДанных = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("ПоляШаблона");
	КомпоновщикНастроек.Инициализировать(
		Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор))
	);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
КонецПроцедуры // ЗагрузитьНастройкиОтбораПоУмолчанию()

// Обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	                  
	Режим = "ПечатьЦенников";
	ИспользоватьПрименениеЦен = Истина;	
	ВидимостьОтбора = Истина;
	ЗагрузитьНастройкиОтбораПоУмолчанию();
	
	Если ЗначениеЗаполнено(Параметры.АдресВХранилище) Тогда
		
		СтруктураДанных = ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище);
		
		Объект.ИсходныеДанные.Загрузить(СтруктураДанных.Товары);
		
		Если ЗначениеЗаполнено(СтруктураДанных.СтруктураДействий) Тогда
			
			ПараметрДействия = Неопределено;
			
			Если СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьОрганизацию", ПараметрДействия) Тогда
				Объект.Организация = ПараметрДействия;
			КонецЕсли;
			
			Если СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьСтруктурнаяЕдиница", ПараметрДействия) Тогда				
				Объект.СтруктурнаяЕдиница = ПараметрДействия;																
			КонецЕсли;
			
			Если СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьВидЦен", ПараметрДействия) Тогда
				Объект.ВидЦен = ПараметрДействия;
			КонецЕсли;
			
			Если СтруктураДанных.СтруктураДействий.Свойство("УстановитьДатуПолученияЦен", ПараметрДействия) Тогда				
				Объект.ЦеныНаДату = ПараметрДействия;			
			Иначе			
				Объект.ЦеныНаДату = ТекущаяДата();			
			КонецЕсли;
			
			ЗаполнитьКоличествоЦенниковПоОстаткамНаСкладе = СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьКоличествоЦенниковПоОстаткамНаСкладе", ПараметрДействия);
						
			Если СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьТаблицуТоваров", ПараметрДействия) Тогда
				ЗаполнитьТаблицуТоваровНаСервере(Ложь);
			КонецЕсли;
			
			Если СтруктураДанных.СтруктураДействий.Свойство("УстановитьРежим", ПараметрДействия) Тогда
				УстановитьРежим(ПараметрДействия);
			Иначе
				ВызватьИсключение НСтр("ru = 'Режим печати не установлен'");
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		// Вызов обработки из интерфейса
		ЗаполнитьКоличествоЦенниковПоОстаткамНаСкладе = Истина;
		
        УстановитьРежимПечатьЦенниковНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
// Процедура вызывается при нажатии на кнопку "Выбрать платежи".
//
Процедура ВыбратьСтроки()
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		
		СтрокаТЧ.Выбран = Истина;			
	КонецЦикла;
		
КонецПроцедуры // ВыбратьСтроки()

&НаКлиенте
// Процедура вызывается при нажатии на кнопку "Исключить платежки".
//
Процедура ИсключитьСтроки()

	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		СтрокаТЧ.Выбран = Ложь
	КонецЦикла;
	
КонецПроцедуры // ИсключитьСтроки()

&НаСервере
//
//
Процедура УстановитьКоличествоПоУмолчаниюВСтрокеТЧНаСервере()
	
	Для каждого Строка из Объект.Товары Цикл
	    Строка.КоличествоЦенников = Строка.ОстатокНаСкладе;
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура УстановитьКоличествоПоУмолчанию(Команда)
	
	УстановитьКоличествоПоУмолчаниюВСтрокеТЧНаСервере();
		
КонецПроцедуры

&НаКлиенте
//
//
Процедура ЗаполнитьПоОстаткам(Команда)
	
	ЗаполнитьТаблицуТоваровНаСервере(Истина, Ложь, Истина, Ложь);
	Документ = Неопределено;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик Команды "ЗаполнитьПоОстаткам
//
Процедура ЗаполнитьПоДокументуПоступления(Команда)
	
	ОткрытьФорму("Документ.Поступление.Форма.ФормаВыбора", Новый Структура("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница),,,,,Новый ОписаниеОповещения("ЗаполнитьПоДокументуПоступленияЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ЗаполнитьПоДокументуПоступленияЗавершение"
//
Процедура ЗаполнитьПоДокументуПоступленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Документ = Результат;
		ЗаполнитьТаблицуТоваровНаСервере(Истина, Ложь, Ложь, Истина);
		ЭтаФорма.ТекущийЭлемент = Элементы.Печать;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "ЗаполнитьПоДокументуПеремещения".
//
Процедура ЗаполнитьПоДокументуПеремещения(Команда)
	
	ОткрытьФорму("Документ.ПеремещениеЗапасов.Форма.ФормаВыбора", Новый Структура("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница),,,,,Новый ОписаниеОповещения("ЗаполнитьПоДокументуПеремещенияЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ЗаполнитьПоДокументуПеремещенияЗавершение"
//
Процедура ЗаполнитьПоДокументуПеремещенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Документ = Результат;
		ЗаполнитьТаблицуТоваровНаСервере(Истина, Ложь, Ложь, Ложь, Истина);
		ЭтаФорма.ТекущийЭлемент = Элементы.Печать;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "Нажатие"
//
Процедура Декорация_ДокументПоступленияНажатие(Элемент)
	
	Если Документ <> Неопределено Тогда 
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
			ОткрытьФорму("Документ.ПеремещениеЗапасов.ФормаОбъекта", Новый Структура("Ключ", Документ));
		Иначе
			ОткрытьФорму("Документ.Поступление.ФормаОбъекта", Новый Структура("Ключ", Документ));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "Печать".
//       
Процедура Печать(Команда)
	
	Если Объект.ШаблонДляПечати.Пустая() = Истина Тогда
	    ПоказатьПредупреждение(,НСтр("ru = 'Не выбран шаблон для печати'"));
		Возврат;
    КонецЕсли;
	
	Если Объект.Товары.НайтиСтроки(Новый Структура("Выбран", Истина)).Количество() = 0 Тогда
		
		 ПоказатьПредупреждение(,НСтр("ru = 'Не выбрано ни одного товара'"));
		Возврат;
		
	КонецЕсли;
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		
		ПараметрКоманды = Новый Массив;   // Добавим объект обработки печати ценников и этикеток в массив параметров печати.
		ПараметрКоманды.Добавить(Объект); // В дальнейшем будем обращаться к объекту через ПараметрКоманды[0]
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Обработка.ПечатьЭтикетокИЦенников", // Для вызова метода менеджера обработки "Печать".
			"Ценники,Этикетки",
			ПараметрКоманды,
			ЭтаФорма, // Форма владелец
			Новый Структура("Режим", Режим));
		
	КонецЕсли;
	
КонецПроцедуры // Печать()

&НаСервере
// Процедура - обработчик события "ПриСохраненииДанныхВНастройкахНаСервере" формы.
//
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Если СохраненныеНастройки <> Неопределено Тогда
		
		Для Каждого КлючИЗначение Из СохраненныеНастройки Цикл
			// Обратное преобразование имени для хранения ключа соответствия для хранения в структуре
			ИмяКлюча = СтрЗаменить(КлючИЗначение.Ключ,"_QTQ_",".");
			ИмяКлюча = СтрЗаменить(ИмяКлюча,"_QPQ_"," ");
			Если ИмяКлюча = "_QQQ_" Тогда
				ИмяКлюча = "";
			КонецЕсли;
			Настройки.Вставить(ИмяКлюча, КлючИЗначение.Значение);
		КонецЦикла;
		
	Иначе		
		// Сохранение отбора выполняется только если это не печать из документа
		Настройки.Вставить("НастройкиОтбора",Новый ХранилищеЗначения(КомпоновщикНастроек.Настройки));		
	КонецЕсли;
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

&НаСервере
// Процедура - обработчик события "ПриЗагрузкеДанныхИзНастроекНаСервере" формы.
//
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Параметры.Свойство("АдресВХранилище") И ЗначениеЗаполнено(Параметры.АдресВХранилище) Тогда
		
		СохраненныеНастройки = Новый Структура;
		Для Каждого КлючИЗначение Из Настройки Цикл
			// Преобразование имени для хранения ключа соответствия для хранения в структуре
			ИмяКлюча = СтрЗаменить(КлючИЗначение.Ключ,".","_QTQ_");
			ИмяКлюча = СтрЗаменить(ИмяКлюча," ","_QPQ_");
			Если ИмяКлюча = "" Тогда
				ИмяКлюча = "_QQQ_";
			КонецЕсли;
			СохраненныеНастройки.Вставить(ИмяКлюча, КлючИЗначение.Значение);
		КонецЦикла;
		
		Настройки.Очистить();
		
	Иначе
		
		// ВидимостьОтбора = Настройки.Получить("ВидимостьОтбора");
		// Элементы.ГруппаОтбор.Видимость = ВидимостьОтбора;
		Элементы.Отбор.Заголовок = ?(ВидимостьОтбора, НСтр("ru = 'Скрыть отбор'"), НСтр("ru = 'Показать отбор'"));
		Объект.ШаблонДляПечати=Настройки.Получить("ШаблонДляПечати");
		Объект.Организация=Настройки.Получить("Организация");
        Объект.СтруктурнаяЕдиница=Настройки.Получить("СтруктурнаяЕдиница");
        Объект.ВидЦен=Настройки.Получить("ВидЦен");
        Объект.ЦеныНаДату=Настройки.Получить("ЦеныНаДату");
	
		НастройкиОтбора = Настройки.Получить("НастройкиОтбора");
		Если НастройкиОтбора <> Неопределено Тогда
			КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтбора.Получить());
		Иначе
			ЗагрузитьНастройкиОтбораПоУмолчанию();
		КонецЕсли;
		
		Режим = Настройки.Получить("Режим");
		Если ЗначениеЗаполнено(Режим) Тогда
			УстановитьРежим(Режим);
		КонецЕсли;
		
		ЦеныНаДату = Настройки.Получить("Объект.ЦеныНаДату");
		Если ЗначениеЗаполнено(ЦеныНаДату) Тогда		
			Объект.ЦеныНаДату = ЦеныНаДату;		
		Иначе		
			Объект.ЦеныНаДату = ТекущаяДата();		
		КонецЕсли;	
		
		СтруктурнаяЕдиниа = Настройки.Получить("СтруктурнаяЕдиниа");
		Если ЗначениеЗаполнено(СтруктурнаяЕдиниа) Тогда
			Объект.СтруктурнаяЕдиниа = СтруктурнаяЕдиниа;			
		КонецЕсли;	
		
	КонецЕсли;
		

	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиентеНаСервереБезКонтекста
//
//
Функция ПроверитьВозможностьВыбораТовара(ТекущиеДанные, Режим)
		
	Если ТекущиеДанные.КоличествоЦенников = 0 ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные.ШаблонЦенника) Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
		
КонецФункции // ПроверитьВозможностьВыбораТовара()

// Процедура - обработчик события "НачалоВыбора" поля "Номенклатура" табличной части "Товары".
//
&НаКлиенте
Процедура ТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры // ТоварыНоменклатураНачалоВыбора()

// Процедура - обработчик события "Очистка" поля "Номенклатура" табличной части "Товары".
//
&НаКлиенте
Процедура ТоварыНоменклатураОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры // ТоварыНоменклатураОчистка()

// Процедура - обработчик события "НачалоВыбора" поля "Характеристика" табличной части "Товары".
//
&НаКлиенте
Процедура ТоварыХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры // ТоварыХарактеристикаНачалоВыбора()

// Процедура - обработчик события "НачалоВыбора" поля "Характеристика" табличной части "Товары".
//
&НаКлиенте
Процедура ТоварыХарактеристикаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры // ТоварыХарактеристикаОчистка()

// Процедура - обработчик события "НачалоВыбора" поля "Упаковка" табличной части "Товары".
//
&НаКлиенте
Процедура ТоварыУпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры // ТоварыУпаковкаНачалоВыбора()

// Процедура - обработчик события "НачалоВыбора" поля "Упаковка" табличной части "Товары".
//
&НаКлиенте
Процедура ТоварыУпаковкаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры // ТоварыУпаковкаОчистка()

// Процедура - обработчик события "ПриИзменении" поля "КоличествоЦенников" табличной части "Товары".
//
&НаКлиенте
Процедура ТоварыКоличествоЦенниковПриИзменении(Элемент)
		
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Выбран = ПроверитьВозможностьВыбораТовара(ТекущиеДанные, Режим);
	
КонецПроцедуры // ТоварыКоличествоЦенниковПриИзменении()

// Процедура - обработчик события "ПриИзменении" поля "ШаблонЦенника" табличной части "Товары".
//
&НаКлиенте
Процедура ТоварыШаблонЦенникаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Выбран = ПроверитьВозможностьВыбораТовара(ТекущиеДанные, Режим);
	
КонецПроцедуры // ТоварыШаблонЦенникаПриИзменении()

// Процедура - обработчик события "ПриИзменении" поля "Выбран" табличной части "Товары".
//
&НаКлиенте
Процедура ТоварыВыбранПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока = ТекущиеДанные.НомерСтроки - 1;
	
	Если НЕ ТекущиеДанные.Выбран Тогда
		
	Иначе
		
		ОчиститьСообщения();
		
		ТекущиеДанные.Выбран = Истина;
		
		Если Режим = "ПечатьЦенниковИЭтикеток" Тогда
			
			Если (       ЗначениеЗаполнено(ТекущиеДанные.ШаблонЦенника)
					И НЕ ЗначениеЗаполнено(ТекущиеДанные.КоличествоЦенников)
					И НЕ ЗначениеЗаполнено(ТекущиеДанные.ШаблонЭтикетки)
					И НЕ ЗначениеЗаполнено(ТекущиеДанные.КоличествоЭтикеток)) Тогда
					
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Не заполнено количество ценников'");
				Сообщение.Поле = "Объект.Товары["+ТекущаяСтрока+"].КоличествоЦенников";
				Сообщение.Сообщить();
				
				ТекущиеДанные.Выбран = Ложь;
				
			ИначеЕсли (НЕ ЗначениеЗаполнено(ТекущиеДанные.ШаблонЦенника)
					 И    ЗначениеЗаполнено(ТекущиеДанные.КоличествоЦенников)
					 И НЕ ЗначениеЗаполнено(ТекущиеДанные.ШаблонЭтикетки)
					 И НЕ ЗначениеЗаполнено(ТекущиеДанные.КоличествоЭтикеток)) Тогда
					
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Не выбран шаблон ценника'");
				Сообщение.Поле = "Объект.Товары["+ТекущаяСтрока+"].ШаблонЦенника";
				Сообщение.Сообщить();
				
				ТекущиеДанные.Выбран = Ложь;
				
			ИначеЕсли (НЕ ЗначениеЗаполнено(ТекущиеДанные.ШаблонЦенника)
					 И НЕ ЗначениеЗаполнено(ТекущиеДанные.КоличествоЦенников)
					 И    ЗначениеЗаполнено(ТекущиеДанные.ШаблонЭтикетки)
					 И НЕ ЗначениеЗаполнено(ТекущиеДанные.КоличествоЭтикеток)) Тогда
					
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Не заполнено количество этикеток'");
				Сообщение.Поле = "Объект.Товары["+ТекущаяСтрока+"].КоличествоЭтикеток";
				Сообщение.Сообщить();
				
				ТекущиеДанные.Выбран = Ложь;
				
			ИначеЕсли (НЕ ЗначениеЗаполнено(ТекущиеДанные.ШаблонЦенника)
					 И НЕ ЗначениеЗаполнено(ТекущиеДанные.КоличествоЦенников)
					 И НЕ ЗначениеЗаполнено(ТекущиеДанные.ШаблонЭтикетки)
					 И    ЗначениеЗаполнено(ТекущиеДанные.КоличествоЭтикеток)) Тогда
					
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Не выбран шаблон этикетки'");
				Сообщение.Поле = "Объект.Товары["+ТекущаяСтрока+"].ШаблонЭтикетки";
				Сообщение.Сообщить();
				
				ТекущиеДанные.Выбран = Ложь;
				
			ИначеЕсли (   ЗначениеЗаполнено(ТекущиеДанные.ШаблонЦенника)
					 И НЕ ЗначениеЗаполнено(ТекущиеДанные.КоличествоЦенников)
					 И    ЗначениеЗаполнено(ТекущиеДанные.ШаблонЭтикетки)
					 И НЕ ЗначениеЗаполнено(ТекущиеДанные.КоличествоЭтикеток)) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Не заполнено количество ценников и(или) этикеток'");
				Сообщение.Поле = "Объект.Товары["+ТекущаяСтрока+"].КоличествоЦенников";
				Сообщение.Сообщить();
				
				ТекущиеДанные.Выбран = Ложь;
				
			ИначеЕсли (НЕ ЗначениеЗаполнено(ТекущиеДанные.ШаблонЦенника)
					 И    ЗначениеЗаполнено(ТекущиеДанные.КоличествоЦенников)
					 И НЕ ЗначениеЗаполнено(ТекущиеДанные.ШаблонЭтикетки)
					 И    ЗначениеЗаполнено(ТекущиеДанные.КоличествоЭтикеток)) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Не выбраны шаблоны ценников и(или) этикеток'");
				Сообщение.Поле = "Объект.Товары["+ТекущаяСтрока+"].ШаблонЦенника";
				Сообщение.Сообщить();
				
				ТекущиеДанные.Выбран = Ложь;
				
			ИначеЕсли (НЕ ЗначениеЗаполнено(ТекущиеДанные.ШаблонЦенника)
					 И НЕ ЗначениеЗаполнено(ТекущиеДанные.КоличествоЦенников)
					 И НЕ ЗначениеЗаполнено(ТекущиеДанные.ШаблонЭтикетки)
					 И НЕ ЗначениеЗаполнено(ТекущиеДанные.КоличествоЭтикеток)) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Не заполнено количество ценников и(или) этикеток'");
				Сообщение.Поле = "Объект.Товары["+ТекущаяСтрока+"].КоличествоЦенников";
				Сообщение.Сообщить();
				
				ТекущиеДанные.Выбран = Ложь;
				
			КонецЕсли;
			
		ИначеЕсли Режим = "ПечатьЭтикеток" Тогда
			
			Если ТекущиеДанные.КоличествоЭтикеток = 0 Тогда
			
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Не заполнено количество этикеток'");
				Сообщение.Поле = "Объект.Товары["+ТекущаяСтрока+"].КоличествоЭтикеток";
				Сообщение.Сообщить();
				
				ТекущиеДанные.Выбран = Ложь;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ШаблонЭтикетки) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Не выбран шаблон этикетки'");
				Сообщение.Поле = "Объект.Товары["+ТекущаяСтрока+"].ШаблонЭтикетки";
				Сообщение.Сообщить();
				
				ТекущиеДанные.Выбран = Ложь;
				
			КонецЕсли;
			
		ИначеЕсли Режим = "ПечатьЦенников" Тогда
			
			Если ТекущиеДанные.КоличествоЦенников = 0 Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Не заполнено количество ценников'");
				Сообщение.Поле = "Объект.Товары["+ТекущаяСтрока+"].КоличествоЦенников";
				Сообщение.Сообщить();
				
				ТекущиеДанные.Выбран = Ложь;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ШаблонЦенника) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Не выбран шаблон ценника'");
				Сообщение.Поле = "Объект.Товары["+ТекущаяСтрока+"].ШаблонЦенника";
				Сообщение.Сообщить();
				
				ТекущиеДанные.Выбран = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ТоварыВыбранПриИзменении()

// Процедура - обработчик команды "ПоказатьСкрытьОтбор".
//
&НаКлиенте
Процедура ПоказатьСкрытьОтбор(Команда)
	
	ВидимостьОтбора = НЕ ВидимостьОтбора;
	Элементы.ГруппаОтбор.Видимость = ВидимостьОтбора;
	Элементы.Отбор.Заголовок = ?(ВидимостьОтбора, НСтр("ru = 'Скрыть отбор'"), НСтр("ru = 'Показать отбор'"));
	
КонецПроцедуры // ПоказатьСкрытьОтбор()

 &НаКлиенте
// Процедура - обработчик команды "УстановитьКоличествоЦенников".
//
Процедура УстановитьКоличествоЦенников(Команда)
	
	ПоказатьВводЧисла(Новый ОписаниеОповещения("УстановитьКоличествоЦенниковПослеВводаЧисла", ЭтотОбъект),Неопределено, НСтр("ru = 'Введите количество ценников'"), 10, 2);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Установить количество ценников после ввода числа
//
// Параметры:
//  Число					 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура УстановитьКоличествоЦенниковПослеВводаЧисла(Число, ДополнительныеПараметры) Экспорт
	
	Если (Число <> Неопределено) Тогда 		
		Для каждого Строка из Объект.Товары Цикл
			Строка.КоличествоЦенников = Число;
		КонецЦикла;			
	КонецЕсли;

КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ РЕЖИМОМ ПЕЧАТИ

// Процедура устанавливает режим "ПечатьЦенников" на сервере.
//
&НаСервере
Процедура УстановитьРежимПечатьЦенниковНаСервере()
	
	АвтоЗаголовок = Ложь;
	Режим = "ПечатьЦенников";
	
КонецПроцедуры // УстановитьРежимПечатьЦенниковНаСервере()

// Процедура выполняет установку выбранного режима печати
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура УстановитьРежим(ПараметрРежим)
	
	УстановитьРежимПечатьЦенниковНаСервере();
	
КонецПроцедуры // УстановитьРежим()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтключитьОтметкуНезаполненного();
	
	// МеханизмВнешнегоОборудования
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ОписаниеОшибки = "";
		
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
		
		Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:
			|""%ОписаниеОшибки%"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	// Конец МеханизмВнешнегоОборудования 

КонецПроцедуры

&НаКлиенте
Процедура ШаблонДляПечатиПриИзменении(Элемент)
	
	индекс=0;
	Пока индекс<Объект.Товары.Количество() Цикл
		
		Объект.Товары[индекс].ШаблонЦенника=Объект.ШаблонДляПечати;
		индекс=индекс+1;
    КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "СтруктурнаяЕдиница".
//
Процедура СтруктурнаяЕдиницаПриИзменении(Элемент)
	
	Объект.Организация = ПолучитьОрганизациюИВидЦен(Объект.СтруктурнаяЕдиница).Организация;
	Объект.ВидЦен = ПолучитьОрганизациюИВидЦен(Объект.СтруктурнаяЕдиница).ВидЦен;

КонецПроцедуры

&НаСервере
// Функция возвращает организацию и вид цен по указанной структурной единице.
//
Функция ПолучитьОрганизациюИВидЦен(СтруктурнаяЕдиница)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Организация", СтруктурнаяЕдиница.Организация);
	СтруктураВозврата.Вставить("ВидЦен", СтруктурнаяЕдиница.ВидЦенРеализации);
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ВнешнееОборудование
	Если Источник = "ВнешнееОборудование" Тогда// И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Данные = Новый Массив();
			Если Параметр[1] = Неопределено Тогда
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[0], 1)); // Достаем штрихкод из основных данных
			Иначе
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[1][1], 1)); // Достаем штрихкод из дополнительных данных
			КонецЕсли;
			ПолученыШтрихкоды(Данные);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолученыШтрихкоды(ДанныеШтрикодов)
	
	НеизвестныеШтрихкоды = Новый Массив;
	
	Для Каждого ЭлементШтрихкода Из ДанныеШтрикодов Цикл
		Если ОбработкаТабличныхЧастейКлиент.СШКОбработкаТабличнойЧасти(Элементы.Товары, ЭлементШтрихкода, Неопределено, Неопределено, Неопределено, Объект.Товары, НеизвестныеШтрихкоды) Тогда
		
			НоваяСтрока = Элементы.Товары.ТекущиеДанные;
			
			НоваяСтрока.ШаблонЦенника  = Объект.ШаблонДляПечати;
			НоваяСтрока.КоличествоЦенников	= 1;
			
			СтруктураДанные = Новый Структура();
			СтруктураДанные.Вставить("ДатаОбработки",		Объект.ЦеныНаДату);
			СтруктураДанные.Вставить("СтруктурнаяЕдиница",	Объект.СтруктурнаяЕдиница);
			СтруктураДанные.Вставить("ВидЦен", 				Объект.ВидЦен);	
			СтруктураДанные.Вставить("Номенклатура", 		НоваяСтрока.Номенклатура);
			СтруктураДанные.Вставить("Упаковка", 			НоваяСтрока.Упаковка);		
			
			СтруктураДанные                        = Ценообразование.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);	
			НоваяСтрока.Цена                       = СтруктураДанные.Цена;
			НоваяСтрока.Упаковка                   = СтруктураДанные.Упаковка;
						
			НоваяСтрока.Штрихкод            = ЭлементШтрихкода.Штрихкод;			
			НоваяСтрока.ОстатокНаСкладе     = 0;// СтрокаТЧ.ОстатокНаСкладе;
			
			НоваяСтрока.Выбран = ПроверитьВозможностьВыбораТовара(НоваяСтрока, Режим);
			
		КонецЕсли;
		
		Если НеизвестныеШтрихкоды.Количество() > 0 Тогда 
			СтруктураПараметров = Новый Структура("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды);
			ОткрытьФорму("РегистрСведений.Штрихкоды.Форма.РегистрацияШтрихкодовНоменклатуры", СтруктураПараметров, ЭтаФорма);
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецФункции // ПолученыШтрихкоды()

&НаКлиенте
// Процедура выполняет заполнение табличной части ПоСправочнику.
//
Процедура ЗаполнитьПоСправочнику(Команда)
	
	ЗаполнитьТаблицуТоваровНаСервере(Истина, Ложь, Ложь, Ложь, Ложь, Истина);
	Документ = Неопределено;

КонецПроцедуры

&НаСервере
// Процедура выполняет заполнение табличной части "Товары".
//
Процедура ЗаполнитьТаблицуТоваровНаСервере(
	ПроверятьЗаполнение       = Истина, 
	Сохранять                 = Истина, 
	ПоОстаткам 				  = Ложь, 
	ПоДокументуПоступления    = Истина, 
	ПоДокументуПеремещения    = Ложь, 
	ПоСправочникуНоменклатуры = Ложь)
    	
	Если ПроверятьЗаполнение И ЭтаФорма.ПроверитьЗаполнение() = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	// Сохранение выбранных позиций для их последующего восстановления.
	Если Сохранять Тогда
		ТаблицаВыбранныеПозиции = Объект.Товары.Выгрузить();
	КонецЕсли;
	
	// Поля необходимые для вывода в таблицу товаров на форме.
	СтруктураНастроек = Обработки.ПечатьЭтикетокИЦенников.ПолучитьПустуюСтруктуруНастроек();
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("Цена");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Штрихкод");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Количество");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Номенклатура");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Партия");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Упаковка");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ОстатокНаСкладе");
	
	// Шаблоны этикеток и ценников.	
	СтруктураНастроек.ПараметрыДанных.Вставить("ВидЦен"   				 , Объект.ВидЦен);
	СтруктураНастроек.ПараметрыДанных.Вставить("СтруктурнаяЕдиницаДляЦен", Объект.СтруктурнаяЕдиница);
	СтруктураНастроек.ПараметрыДанных.Вставить("ЦеныНаДату"				 , Объект.ЦеныНаДату);	
	СтруктураНастроек.ПараметрыДанных.Вставить("Организация"			 , Объект.Организация);
	СтруктураНастроек.КомпоновщикНастроек = КомпоновщикНастроек;
	
	Если ПоДокументуПоступления Тогда 
		
		СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоДокументуПоступления";
		СтруктураНастроек.ПараметрыДанных.Вставить("ДокументПоступления", Документ);
		Элементы.Декорация_ДокументПоступления.Заголовок = "Поступление товаров № " + Документ.Номер + " от " + Формат(Документ.Дата, "ДЛФ=DD");
		
	ИначеЕсли ПоДокументуПеремещения Тогда 
		
		СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоДокументуПеремещения";
		СтруктураНастроек.ПараметрыДанных.Вставить("ДокументПоступления", Документ);
		Элементы.Декорация_ДокументПоступления.Заголовок = "Перемещение товаров № " + Документ.Номер + " от " + Формат(Документ.Дата, "ДЛФ=DD");
	Иначе 
		Если Объект.ИсходныеДанные.Количество() > 0  Тогда
			СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблона";
			СтруктураНастроек.ИсходныеДанные = Объект.ИсходныеДанные.Выгрузить();
		Иначе
			СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблонаБД";
		КонецЕсли;
		
		Элементы.Декорация_ДокументПоступления.Заголовок = "";
		
	КонецЕсли;
	
	Объект.Товары.Очистить();
	
	// Загрузка сформированного списка товаров.
	СтруктураРезультата = Обработки.ПечатьЭтикетокИЦенников.ПодготовитьСтруктуруДанных(СтруктураНастроек);
	Для Каждого СтрокаТЧ Из СтруктураРезультата.ТаблицаТоваров Цикл
		
		Если ((ПоДокументуПоступления ИЛИ ПоДокументуПеремещения) И СтрокаТЧ.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас)
			ИЛИ (СтрокаТЧ.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас И ПоОстаткам И СтрокаТЧ.ОстатокНаСкладе <> Null И СтрокаТЧ.ОстатокНаСкладе > 0) 
			ИЛИ ПоСправочникуНоменклатуры Тогда
			
			НоваяСтрока = Объект.Товары.Добавить();
			НоваяСтрока.Номенклатура         = СтрокаТЧ.Номенклатура;
			НоваяСтрока.Партия               = СтрокаТЧ.Партия;
			НоваяСтрока.Упаковка             = СтрокаТЧ.Упаковка;		
			НоваяСтрока.Цена                 = СтрокаТЧ.Цена;
			НоваяСтрока.Штрихкод             = СтрокаТЧ.Штрихкод;
			НоваяСтрока.ОстатокНаСкладе      = СтрокаТЧ.ОстатокНаСкладе;
			НоваяСтрока.КоличествоЦенников 	 = СтрокаТЧ.ОстатокНаСкладе;
			
			Если Объект.ШаблонДляПечати <> Справочники.ХранилищеШаблонов.ПустаяСсылка() Тогда
			     НоваяСтрока.ШаблонЦенника   = Объект.ШаблонДляПечати;
			КонецЕсли;
						
			// Восстановление позиций, сохраненных перед заполнением ТЧ. 
			Если Сохранять Тогда
				
				ПараметрыОтбора = Новый Структура();
				ПараметрыОтбора.Вставить("Номенклатура", НоваяСтрока.Номенклатура);
				ПараметрыОтбора.Вставить("Партия"      , НоваяСтрока.Партия);
				ПараметрыОтбора.Вставить("Упаковка"    , НоваяСтрока.Упаковка);
				
				НайденныеСтроки = ТаблицаВыбранныеПозиции.НайтиСтроки(ПараметрыОтбора);
				
				Если НайденныеСтроки.Количество() > 0 Тогда
					ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденныеСтроки[0],"ШаблонЦенника, КоличествоЦенников");	
				КонецЕсли;
				
			КонецЕсли;
			
			НоваяСтрока.Выбран = ПроверитьВозможностьВыбораТовара(НоваяСтрока, Режим);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.Товары.Обновить();
	
КонецПроцедуры // ЗаполнитьТаблицуТоваровНаСервере()

 #КонецОбласти
